# Parameters
nc: 1  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple
anchors:
  - [12,15, 14,32, 45,24]
  - [22,56, 106,31, 69,54,]
  - [40,104, 149,47, 76,167]
backbone:
  # [from, number, module, args]
  [ [ -1, 1, Conv, [ 64, 6, 2, 2 ] ],  # 0-P1/2
    [ -1, 1, Conv, [ 128, 3, 2 ] ],  # 1-P2/4
    [ -1, 3, C3, [ 128 ] ],
    [ -1, 1, Conv, [ 256, 3, 2 ] ],  # 3-P3/8
    [ -1, 6, C3, [ 256 ] ],
    [ -1, 1, Conv, [ 512, 3, 2 ] ],  # 5-P4/16
    [ -1, 9, C3, [ 512 ] ],
    [ -1, 1, Conv, [ 1024, 3, 2 ] ],  # 7-P5/32
    [ -1, 3, C3, [ 1024 ] ],
    [ -1, 1, SPPF, [ 1024, 5 ] ],  # 9
  ]


head:
  [
  [-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # s5 11
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [512, False]], # 13 p4
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # s4  15
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3, [256, False]], # 17 p3
   [ -1, 1, Conv, [ 128, 1, 1 ] ],
   [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ], # s3  19
   [ [ -1, 2], 1, Concat, [ 1 ] ],
   [-1, 3, C3, [64, False]], # 21 p2
   [[17,13,11],1,TFF,[256]], # 22 d4
   [[21,17,15],1,TFF,[256]], # 23 d3
   [[23],1,Zhead,[256]], # 24 h3
   [[22],1,Zhead,[256]], # 25 h4
   [[9],1,Zhead,[256]], # 26 h5
   [[24,25,26], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
